["Accelerate\nWhether you’re ideating on a new startup, working on a personal project, or looking to bring your academic assignments to the next level, Accelerate has you covered. Our tools + resources are free to use for all WIT Students, faculty and staff no matter what your background or experience level is.   Unlock your full potential and discover new skills through training and workshops, collaborate and innovate in our ideation space + project rooms, or just be inspired by the things your peers are making right here in our Makerspace!   Our space includes: -Full woodshop/hand tools -Electronic/soldering station -Sewing station -Digital fabrication equipment -Media equipment -AND SO MUCH MORE!!!\nhttps://se-images.campuslabs.com/clink/images/d212b4df-b684-44c9-88c9-901af55ff9e9894f696f-bc1c-4eeb-b509-1d36eb90290d.jpg?preset=med-sq\nAccelerate@wit.edu\n", "ACM WIT Students Chapter\nThe Wentworth Association of Computing Machinery is open to all students. The ACM WIT Students Chapter is a club affiliated with the official ACM organization. Much like our parent organization, our goal is to promote education and research in the computer science, cybersecurity, computer networking, and computer engineering fields. The ACM WIT Students Chapter differs from a plethora of other clubs in that we are chartered by ACM (the Association for Computing Machinery). ACM), ACM is the largest body of computer scientists globally. The organization’s objective is to facilitate communication and collaboration within a university's computer science community and with the computing community at large. Thus, by leveraging the opportunities provided by ACM, we focus on hands-on projects and experiences, with workshops and mini lectures given by professors and industry experts.\nhttps://se-images.campuslabs.com/clink/images/9e04e858-de4a-48ff-9fd0-d56e25ee4dc9a3df4303-7691-4d87-8228-73b1a2c60e98.png?preset=med-sq\nNone\n", "Alpha Omega\nWe are a group focused on building community around the Bible. With lively discussions and fun events we strive to understand the Bible and what it means for us as college students today.\nhttps://se-images.campuslabs.com/clink/images/6c134b4a-3711-4b78-a85c-b479e368c9598efcc0fd-7314-4c59-8b62-1460bf84c850.png?preset=med-sq\nkinscheckc@wit.edu\n", "American Foundry Society\nThe Wentworth American Foundry Society is open to all students. The American Foundry Society (AFS) is a professional, technical and trade association for foundries and the broader metal casting industry. The society promotes the interests of foundries to policymakers, provides training for foundry workers, and supports research and technological advancements in foundry science and manufacturing. AFS represents ferrous and nonferrous foundries based in North America, as well as industry suppliers and end-users of metal castings from around the world. The society has individual and corporate members across 48 countries, organized into regional chapters and student chapters in the United States, Canada and Mexico. AFS presents Metalcasting Congress, a yearly industry conference, as well as CastExpo, a trade show and exposition that occurs every three years.\nhttps://se-images.campuslabs.com/clink/images/d56d7924-cc62-465d-81de-cfec53b69462eaaea41b-8528-4c4a-ab21-fe3f4c0327fd.png?preset=med-sq\nafs@wit.edu\n", "American Medical Student Association Wentworth Institute of Technology Chapter\nThe American Medical Student Association at Wentworth is open to all students. This club aims to support medical students or students interested in pursuing a career in the healthcare industry by providing them with skills and knowledge to bridge the gaps in some aspects of premedical education. To be committed to the improvement of healthcare and healthcare delivery to all people; to promote the active improvement of medical education; to involve its members in the social, moral and ethical obligations of the profession of medicine; to assist in the improvement and understanding of world health problems; to contribute to the welfare of all members, including premedical students, medical students, interns, residents and post-M.D./D.O. trainees; to advance the profession of medicine; to work to ensure that medicine reflects the diversity of society, with diversity including but not limited to differences in age, culture, race/ethnicity, sexual orientation and gender identity, gender and disability.  \nhttps://se-images.campuslabs.com/clink/images/95c34fbf-891a-4acd-9d13-084129532686959ddbd2-ed55-4844-98ef-666e6c845b71.PNG?preset=med-sq\nNone\n", "American Society of Biochemistry and Molecular Biology\nThe American Society of Biochemistry and Molecular Biology at Wentworth is open to all students Space for students to learn more about Biochemistry and Molecular Biology Volunteer in STEM activities Read scientific journals to learn more about upcoming research Present at regional and national conferences Assist in finding co-ops and research opportunities  Network with professionals and other student chapters Participate in science outreach with the community\nhttps://se-images.campuslabs.com/clink/images/b8e26c2f-ecc7-44fd-8682-a09bf1470be0532e1f38-0b7d-4b06-ac06-a75d7c1a0bd1.png?preset=med-sq\nmoraesrosam@wit.edu\n", "American Society of Civil Engineers Wentworth Student Chapter\nThe American Society of Civil Engineers Wentworth Student Chapter is open to all students. Join thousands of ASCE Student Members who are making a difference in the Civil Engineering professional community right now, while still in college. Compete in the annual ASCE Concrete Canoe and AISC Steel Bridge Competitions against all New England schools. Spend a day volunteering in community clean-ups or STEM days for elementary and high school-aged students. Connect with alumni and current professionals to add to your network.  https://www.asce.org/student-chapters/   ASCE has hundreds of Student Chapters in the US and around the world, all actively supporting students’ growth as future civil engineers.  Being part of a student community is just one of the many ASCE member benefits you can enjoy as you plan your next moves on the path to graduation.\nhttps://se-images.campuslabs.com/clink/images/b9af9ec0-423d-4500-b839-7a4db076b2ee6aabd39b-36be-47cf-9d73-323cfbf877e6.jpg?preset=med-sq\ncsl_asce@wit.edu\n", "Armenian Students' Association\n\nhttps://se-images.campuslabs.com/clink/images/f76977fc-ab16-4bb1-81e1-57a5ea8dd05e873a3a3b-1ce6-4b7c-8d97-2083de5be0b0.png?preset=med-sq\nvorperians@wit.edu\n", "Asian Student Association\nSalaam, Konnichiwa, Ni Hao, Annyeonghaseyo, Shalom, Namaste, Barev Dzez, Assālam ‘Alaykum, Xin Chào The Asian Student Association at Wentworth is open to all students. Welcome to Wentworth's Asian Student Association page! Asian Student Association's goal is to bring the community at Wentworth together through events and activities inspired by Asian culture and create a safe and welcoming space that encourages those interested in the culture and traditions to get involved. We are an inclusive cultural club and encourage anyone interested in learning about different Asian cultures to participate in our social events and general body meetings. Our mission is to provide a platform for students to share their cultural experiences and meet other students with similar backgrounds. ASA's purpose is to promote the diversity of Asian culture and share it within the Wentworth community. Our club values culture, identity, and inclusivity.    Join Our Discord: https://discord.gg/dUfM4FCy Follow us on Instagram: https://www.instagram.com/wit_asa/    \nhttps://se-images.campuslabs.com/clink/images/756b8a7f-654a-4f74-8231-642569007825d217b170-1940-478e-800f-2c02cbd85dee.png?preset=med-sq\na, Ni Hao, Annyeonghaseyo, Shalom, Namaste, Barev Dzez, Assālam ‘Alaykum, Xin Chào\n", "ASME - American Society of Mechanical Engineers\nThe Wentworth ASME student section is open to all students. The purpose of our group is to promote the development of students’ technical skills as well as leadership qualities. We aim to advance our members professionally through Projects, seminars, and guest lectures with practicing engineers, ASME design challenges, and community involvement.\nhttps://se-images.campuslabs.com/clink/images/aacc74a2-7ae6-469d-ac9c-6283ec8b299d12ecfba9-3a0d-4a31-9e14-885cc6a42e3b.jpg?preset=med-sq\nasme@wit.edu\n", "Caribbean American Student Association\nOur mission is to create a welcoming space where students of Caribbean descent—and those who appreciate the culture—can connect, share experiences, and contribute to the Caribbean's economic development. CASA aims to promote unity, peace, and a deeper understanding of Caribbean heritage & impact. As a student organization at Wentworth, the Caribbean American Student Association is committed to serving as a support group academically, culturally, and socially by providing activities and events to which its members can relate.  CASA is open to all students interested in learning about and supporting Caribbean culture.\nhttps://se-images.campuslabs.com/clink/images/7238c2bb-264a-48f9-979f-4790a258398501c3f0f6-5b22-42c5-863e-f019f5d46317.png?preset=med-sq\nll students interested in learning about and supporting Caribbean culture.\n", "Catholic Student Association\n\nhttps://se-images.campuslabs.com/clink/images/f7157096-adfd-4854-ba5d-076147cd4f4321797022-8074-4f43-b32e-1ea3647dda09.png?preset=med-sq\ncatholics@wit.edu\n", "Center for Culture and Community\nCCC is a student-centered hub that cultivates inclusive culture and community at Wentworth. We coordinate cultural heritage programming, and run transition and success initiatives like RAMP and Bridges Academy in partnership with campus units. Through workshops, mentoring, and collaborations with community-based organizations, CCC equips students, staff, and faculty to practice inclusive excellence in classrooms, labs, and co-curricular spaces.\nhttps://se-images.campuslabs.com/clink/images/a7b9fec6-81fa-4085-a186-f34387f990ced4b5be06-0f90-4db6-b527-803cadbc2ef6.jpg?preset=med-sq\nccc@wit.edu\n", "Center for Student Life\nWentworth Events Board  Wentworth Student Government  Clubs and Organizations  With over 70 student organizations at Wentworth, you are bound to find something that interests you. Jump on a podcast with Wentworth Internet Radio + Entertainment (WIRE), get into the scrum with our Men’s and Women’s Club Rugby teams, take a hike in the White Mountains with Outing Club, or build and test a concrete canoe with the American Society of Civil Engineers. Whatever your interests, you will be able to Find Your FIT at WIT! And if you haven't found the group for you, you can create your own.     Transition Programs Our transition programs provide new students with the support and resources necessary to get off to a successful start at Wentworth. New Student Orientation is a two-day overnight program held during June that allows all first-year students to explore campus and meet classmates, faculty members, and staff. Wentworth Opening Week takes place over the course of four days prior to the start of the fall semester, and helps prepare students to make the most of the academic and extracurricular opportunities that exist at Wentworth. Additional programs for new transfer students and international students are offered to address the unique elements of these students' transition to Wentworth.  Commuter Student Programs  Center for Student Engagement Employment Opportunities \nhttps://se-images.campuslabs.com/clink/images/11fd8e6c-fcf6-4cc6-b990-d8cedcb849986b8f4010-fb1b-4a34-8ca2-59d9f4e88021.jpg?preset=med-sq\nBoard \n", "Center for Wellness\nThe mission of the Center for Wellness is to deliver comprehensive support to all students by providing direct services and information, and resources in three areas—mental health counseling, accessibility support and accommodations, and health promotion\nhttps://se-images.campuslabs.com/clink/images/554d234d-6f89-458c-a3ca-c891cb53baa7aab4c676-9a0b-410b-acb1-9210e102b8c6.jpg?preset=med-sq\ncenterforwellness@wit.edu\n", "Chi Alpha at WIT\nhttps://chialpha.com/\nhttps://se-images.campuslabs.com/clink/images/b7b249af-01cd-40dd-a3df-eb1ba85c6ed445106c7e-7e96-4cb4-bcaa-09a037f5cd7e.PNG?preset=med-sq\nNone\n", "Class of 2026\n\nNone\nstudentlife@wit.edu\n", "Class of 2027\nOfficial LeopardSpot Portal for Class of 2027\nhttps://se-images.campuslabs.com/clink/images/722b4f2d-1e1b-4b2f-99a1-98668ec559a06b7e995f-9ad6-458b-823a-403043c54d6e.png?preset=med-sq\nstudentengagement@wit.edu\n", "Class of 2028\n\nhttps://se-images.campuslabs.com/clink/images/aaf1a603-6ee9-4b51-9a83-5530ecba4362ba6bb005-0094-495e-ba09-029e43bb5c59.png?preset=med-sq\nstudentlife@wit.edu\n", "Class of 2029\n\nNone\nstudentlife@wit.edu\n", "Club Rowing\nClub rowing team based out of Boston, MA. \nhttps://se-images.campuslabs.com/clink/images/d529d537-e59f-46cb-9f3b-bc644b787c04c356ebd7-4f60-4e78-86be-6e692d81c327.png?preset=med-sq\nrowing@wit.edu\n", "Club Sports\nLooking to stay active at Wentworth? Wentworth’s Club Sports teams provide a safe but competitive recreational outlet for students at WIT. Our teams practice weekly and travel locally to compete with other club sports teams. Designed to improve and compliment the quality of campus life, being involved with a club sport can refine leadership skills, promote organizational management, build lasting connections and they can be fun!  \nhttps://se-images.campuslabs.com/clink/images/4260f064-f36c-4906-917c-88189927c978ae68804d-77f7-49cc-9de9-a4d39d81aca6.jpg?preset=med-sq\n17-989-4797\n", "Co-ops & Careers\nA full range of career guidance which includes cooperative education and career advising, co-op preparation classes, career advancement activities sessions, career resources, graduate school planning, and various opportunities to network with employers\nhttps://se-images.campuslabs.com/clink/images/4281ff3d-0c81-4365-8f22-42ac42b0e6e273fad175-729a-4546-8ced-90ebe694eaae.png?preset=med-sq\ncoopsandcareers@wit.edu\n", "Colleges of the Fenway\nThis collaboration was created to add value to student academic and social life while seeking innovative methods of investing in new services and containing the costs of higher education. Collectively, the colleges represent more than 12,000 undergraduate students, comprising 16.2% of the total Boston population of undergraduates attending four-year colleges, more than 700 full-time faculty, and 2,300-course offerings. There is never a dull moment for a member of the COF as events and programs occur on a daily basis on the five campuses, online, and throughout Boston! Cross-Registration and COF Minors Programs and Events Sport and Recreation Performing Arts Center for Sustainability and the Environment Global Education Opportunities (GEO) Center   Click HERE to sign-up to receive update on COF programs, events, and other opportunities!\nhttps://se-images.campuslabs.com/clink/images/86a4a434-8bf7-4a44-a9b8-b007caa75f9ae75e203d-fc54-488c-868d-cd8dc58506a1.png?preset=med-sq\nwilliamsj39@wit.edu\n", "Commuter Life\nPrograms and Events for WIT Commuter Students!\nhttps://se-images.campuslabs.com/clink/images/00ce64d9-a3ca-46d8-85cb-ce12ab88cb05fad89e38-1bde-429f-97e2-3088b4908d98.png?preset=med-sq\nstudentlife@wit.edu\n", "Construction Management Club\nThe Construction Management club at Wentworth is open to all students.\nhttps://se-images.campuslabs.com/clink/images/8d068c79-215c-4d8a-a3ca-e55f0970c48985b3cd29-a407-4d8b-bf34-bbcd6670887c.JPEG?preset=med-sq\ncmclub@wit.edu\n", "Costume Club\nThe Costume Club at Wentworth is open to all students. We have members with various skills and talents so that we can help each other, get ideas & feedback, try new things together, and overall become friends! You can check out some of our amazing projects in the Accelerate Makerspace! We utilize discord to stay connected online, so come join us here. If you have any questions feel free to reach out to us by emailing: costumeclub@wit.edu or you can message us on instagram here!\nhttps://se-images.campuslabs.com/clink/images/1a92953d-1856-477f-a17a-64e8f29fad002e091de0-4d04-4d4a-9be4-a23ff71c68ea.png?preset=med-sq\ncostumeclub@wit.edu\n", "Cru Wentworth\nCru is a community that loves God & one another - a place to explore your questions on college, faith, and what it means to know Christ. Wherever you are, whatever you believe, let's journey together. We meet weekly for Bible studies and fellowship, and there are many opportunities to connect with students from other campuses in the area.\nhttps://se-images.campuslabs.com/clink/images/07498ee5-08af-4502-bc2f-5a02e55f0c2044ed6654-a693-4283-99d6-55dc1d3d7a27.jpg?preset=med-sq\nbrokawr@wit.edu\n", "Cyber Security Club\nThe Cybersecurity Club at Wentworth is open to all students and is the COF's primary resource for cybersecurity networking amongst peers. We primarily focus on teaching skills, Capture The Flag(CTF) style events, bringing in guest speakers, and working with other clubs to create campus events! This year, 2025-2026, we'll also be looking to attend more conferences off campus. Our Discord: https://discord.gg/VwdE9sJT\nhttps://se-images.campuslabs.com/clink/images/b068180e-4a84-4b09-885a-c19dc2cadc372c8081d0-b09c-4c3b-9575-7d8556b4844a.jpg?preset=med-sq\nrso_csc@wit.edu\n", "Dean of Students Office\nThe Dean of Students Office acts as a resource, referral agent, and advocate for students so they may live and learn successfully throughout their Wentworth experience. Whether you need advice or support on academic or personal matters, we can help you access the resources and solutions you need. In the past, we have helped students with such concerns as missing a significant number of classes due to illness or injury, experiencing financial hardships, or difficulties with the transition into college life. These are among the services and resources we can provide: Receive support for personal, financial, or academic matters Submit an Absence Notification Request Report concerning or threatening behaviors Receive information about the Wentworth Student Handbook Fulfilling your Jury Duty service as a student File an official concern/complaint at the Institute Learn about the Student Emergency Fund Access the Wentworth Supply Closet Submit a Voluntary Disclosure of Physical Access Needs Form Seek assistance to request a Medical Leave of Absence Report a violation of the Student Code of Conduct Receive information regarding Family Educational Rights and Privacy Act (FERPA) The Dean of Students Office also oversees compliance with the Student Code of Conduct and the processes used to administer and enforce it throughout the Wentworth community. The office also provides assistance with Student Code of Conduct violations\nhttps://se-images.campuslabs.com/clink/images/9950b901-cd44-4778-be3d-453d1ad59254195e98dd-e61b-4efd-a2e3-290ca4635287.jpg?preset=med-sq\nhe services and resources we can provide:\n", "Douglas D. Schumann Library & Learning Commons\nThe Douglas D. Schumann Library & Learning Commons is a dynamic, technology-driven space for students and faculty to collaborate and learn. We strive to be an open, safe, welcoming space in which academic and social learning can take place in an atmosphere of respect for all of our community members. For more information, please visit our website at library.wit.edu.\nhttps://se-images.campuslabs.com/clink/images/9c4b29bf-7877-43bd-8427-8a4c86e66b3d8b59b410-7208-426f-976b-003f00388571.jpg?preset=med-sq\nlibrary@wit.edu\n", "Equity and Community Union\nThe Equity & Community Union (ECU) is an organization of Wentworth students who are dedicated to fostering an inclusive environment for students from all sorts of backgrounds. We work directly with student leaders and staff to listen to students ideas and help bring them to life. The purpose of the organization is to provide students with an avenue to pursue projects pertaining to social justice on campus. The ECU will also host an Equity Pitch Night where students can pitch ideas for social justice projects and form teams to help pursue them. \nhttps://se-images.campuslabs.com/clink/images/c677cca5-3f29-4f9a-9324-5888bc1775dbe999e3ac-738e-4c8b-9709-7fe3b3f48fd1.png?preset=med-sq\nwentworthecu@gmail.com\n", "Fenway Running Club\nThe Fenway Running Club is open to all students. We meet weekly to go on runs in the Boston area. Our goal is to create a fun atmosphere for new and experienced runners. Members can connect with each other for runs through the club. We keep members informed about local running events/charities.    Please join our GroupMe to find out when we're running! 1. Download GroupMe 2. Use this link https://groupme.com/join_group/92172842/MDn51UQH   Current Fall Run Times:  Tuesdays @5:00 PM meeting in the Wentworth Quad/Beatty Pavilion\nhttps://se-images.campuslabs.com/clink/images/b35859c6-fcac-4348-b012-e29355ca7e8568ea964b-1eec-4acb-b23b-71731af502a7.png?preset=med-sq\nfenwayrunners@wit.edu\n", "Financial Aid\n\nhttps://se-images.campuslabs.com/clink/images/ddc66b58-9cd9-474e-93f1-db01dfa659c257776e14-2994-4835-82d6-b7195443fefe.png?preset=med-sq\nfinaid@wit.edu\n", "FIRST Alumni Association of Wentworth\nThe FAAW is open to all students. The FIRST Alumni Association of Wentworth aims to create an outlet for both Students and FIRST Alumni at Wentworth to give back to the FIRST robotics community through mentorship roles, volunteer positions, and other forms of community service. The Association also aims to create an environment where students can bond and have fun through technical challenges and activities in which they can develop and refine their skills as Engineers and Designers.\nhttps://se-images.campuslabs.com/clink/images/2ea05a85-1dfa-4d77-947d-36c010359fa7f17daa62-2f8f-40d6-9868-c5a203349467.jpg?preset=med-sq\nmarrv@wit.edu\n", "Fitness and Wellness\nWe strive to provide positive co-curricular activities and experiences designed to enrich lives, develop talents, and offer an arena for discovery and self-exploration.  Find us in the Flanagan Campus Center at Beatty Hall on the Wentworth Institute of Technology campus.  Fall & Spring Hours Monday-Thurs: 6am - 11pm Friday: 6am - 9pm Saturday: 9am - 6pm Sunday: 11am - 9pm *Last Updated Spring 2021\nhttps://se-images.campuslabs.com/clink/images/8e55a4b5-5b7f-4d34-afd7-189ed3137b0fa1aadc69-6d53-48da-b0e4-a95b17cb778b.jpg?preset=med-sq\nrs\nMonday-Thurs: 6am - 11pm\nFriday: 6am - 9pm\nSaturday: 9am - 6pm\nSunday: 11am - 9pm\n", "FrauHaus - Designers for Diversity\nWe focus our efforts on the needs of underrepresented voices in design. We create a supportive community of Design Students and Professionals to strengthen student confidence, stimulate personal growth, promote academic achievement, build leadership skills, and guide career planning. We differentiate ourselves from other organizations through focusing specifically on diversity and inclusion in SoAD to equip students with skills/needs that will empower them in a male dominated field.\nhttps://se-images.campuslabs.com/clink/images/613c1e9c-88bb-46cd-b2ae-a5b45888878269ce11dd-5e1c-4436-8bda-160755801761.jpg?preset=med-sq\nfrauhaus@wit.edu / peasee@wit.edu\n", "Hands Of Wentworth\nHands of Wentworth, a community service club dedicated to creating a positive impact in Boston. Our mission is to uplift the city through thoughtful initiatives, impactful events, and collaborative volunteer efforts, creating a stronger and more supportive community one step at a time.\nhttps://se-images.campuslabs.com/clink/images/efe05146-be16-49db-82ae-20c776b563ded16fed9f-6de6-4801-bdbf-a7ef496423ee.png?preset=med-sq\nmwauraj@wit.edu\n", "IEEE-Eta Kappa Nu\nThe IEEE EKA at Wentworth is open to all students. IEEE-Eta Kappa Nu (IEEE-HKN), the honor society of IEEE, promotes excellence in the profession and in education with ideals of Scholarship, Character and Attitude. HKN promotes professional accomplishment, service to others, and leadership development for students and professionals in electrical engineering, computer engineering, and other IEEE fields of interest. At Wentworth, our members get chance to attend student leadership conferences, apply for scholarships, join in our Guest Speaker, Workshop events which the speakers and instructors are invited from the industry with leadership roles and faculty/staff members. We also do talk show which we invite alumni and current outstanding students come share with us their successes and failures. Moreover, the society offers tutoring some courses each semester, technical lab skill lectures and related workshop to prepare students for their co-ops, connect students with recruiters. ------------------------------------------------ Founded in 1904 by Maurice L.Carr and nine fellow students at the University of Illinois, Eta Kappa Nu (HKN) was originally established to help electrical engineering graduates find employment and gain footholds in their careers. Today, IEEE-HKN is 200,000+ members strong and is the honor society for IEEE, the world’s largest technical professional organization for advancing technology for humanity. IEEE-HKN is still dedicated to encouraging and recognizing academic excellence, impeccable character and the positive attitude needed to lead and serve others. IEEE-HKN develops promising young professionals into resilient, collaborative, global citizens and is with them through every step of their professional journey. IEEE-HKN offers access to countless experiences, opens doors to a lifetime of learning, and encompasses a global network of visionary leaders with heart.\nhttps://se-images.campuslabs.com/clink/images/6e334d6e-de35-4c27-81ba-2915f96f3d2f2358f974-671e-4ef9-afb9-6fc1fdee1ebf.png?preset=med-sq\nentworth is open to all students. IEEE-Eta Kappa Nu (IEEE-HKN), the honor society of IEEE, promotes excellence in the profession and in education with ideals of Scholarship, Character and Attitude. HKN promotes professional accomplishment, service to others, and leadership development for students and professionals in electrical engineering, computer engineering, and other IEEE fields of interest.\n\nAt Wentworth, our members get chance to attend student leadership conferences, apply for scholarships, join in our Guest Speaker, Workshop events which the speakers and instructors are invited from the industry with leadership roles and faculty/staff members. We also do talk show which we invite alumni and current outstanding students come share with us their successes and failures. Moreover, the society offers tutoring some courses each semester, technical lab skill lectures and related workshop to prepare students for their co-ops, connect students with recruiters.\n", "IIDA Campus Center\nThe Wentworth IIDA Campus Center (formally known as  SAID) is open to all students. We are comprised of young designers whose goal is to support each other in both education and emerging into the field of interior design. We organize and attend networking events and often tour different firms in Boston. Our group plans trips that reinforce our knowledge of what we learn in the studio and our history of architecture courses. Joining Wentworth IIDA is the perfect way to get involved in the program and gain leadership opportunities, all while hanging out with friends and peers. \nhttps://se-images.campuslabs.com/clink/images/bb09841c-4921-41ed-b553-cae1c9982c858ff77f3d-258a-4b91-be52-cd9514d93b34.png?preset=med-sq\nnguyenu1@wit.edu\n", "Institute of Electrical and Electronic Engineers\nThe IEEE at Wentworth is open to all students. IEEE is a student run organization that aims to provide a community in which members can learn and make the most of the their technical ability, experience, and interest. The club will provide resources to produce an environment for extra-curricular practical learning through student run projects, weekly meetings, workshops, and events. Large focus on extracurricular projects, along with networking, technical skills, and learning. \nhttps://se-images.campuslabs.com/clink/images/cb5aa14a-e151-4d5f-a752-9063df19aeed57e52ecd-a3d6-4cca-8de7-a69d3d302ae5.png?preset=med-sq\nrso_ieee@wit.edu\n", "International Student Services and Engagement\nWith ~200 international students from 55+ countries, International Student Services and Engagement providing inbound compliance based visa status advising, international student specific resources, language exchange partners, and cultural programs. All are welcome to participate in our programs. \nhttps://se-images.campuslabs.com/clink/images/1d118fc8-99f3-4134-9b1d-c5ab9abfc3d9d863718e-14ac-4060-a277-ac2f899833d8.jpg?preset=med-sq\nNone\n", "Jewish Engineers of Wentworth\nJewish Engineers of Wentworth (JEW) is an inclusive organization meant to teach and share Jewish culture and Judaism. We host events that are connected to culture, religion, and history. Anyone can join, you don't even have to be Jewish or an engineering major.\nhttps://se-images.campuslabs.com/clink/images/76380666-9b63-429f-ae83-e26729e74b0a72a2d18b-1fa4-40af-9099-80919a544035.png?preset=med-sq\naskinasiz@wit.edu\n", "Math and Data Science Society\nThe Math and Data Science Society is a group dedicated to advancing knowledge and skills in the field of data science. This society provides opportunities for members to learn, collaborate, and network through workshops, projects, and events. We often aim to bridge the gap between academia and industry, connecting students and professionals with employers and resources.\nhttps://se-images.campuslabs.com/clink/images/4ce8c491-7892-4277-99d2-5630994a85488526668c-0653-4e4d-ae8c-5ded69c44a86.png?preset=med-sq\nNone\n", "Milk Club\nThe MILK club at Wentworth is open to all students. The Milk Club aims to unite students with a common interest for milk and other dairy products by providing a stress-free environment in which to promote admiration and understanding concerning the variety of relevant products produced globally. Club activities may include any of the following: the sampling of local, national, and international milk beverages; the discussion of milk varieties and other related dairy products.\nhttps://se-images.campuslabs.com/clink/images/bd0c2487-9581-4855-b3f6-1e2d05e81b221b855c04-4b43-4dd0-90ff-f890d5bb2c2b.png?preset=med-sq\nmilk@wit.edu\n", "Muslim Student Association\nMuslim Student Association\nhttps://se-images.campuslabs.com/clink/images/0acb4170-d296-4eb4-a66b-bd0fc66fa54f19ff4c44-d439-4bea-a908-9665f2ddcd3c.PNG?preset=med-sq\nmsa@wit.edu\n", "National Electrical Contractors Association (WIT Student Chapter)\nThe National Electrical Contractors Association (NECA) at Wentworth welcomes ALL STUDENTS! Our club provides exceptional opportunities to engage with leading electrical contractors, not only from the Boston area but from across the United States. Each year, our Student NECA chapter participates in an electrical-focused challenge presented by ECIC, competing against more than fifteen colleges nationwide, each representing their regional NECA chapters. This challenge incorporates real-world construction management and engineering concepts, allowing students to gain hands-on experience in the proposal process from an electrical contractor’s perspective. In addition to our annual group project, we offer industry-related trips, including conventions, site visits, and networking events with electrical professionals. We also host guest speakers and monthly meetings (with dates and times varying each semester) to keep members engaged and informed. Join us to expand your professional network, gain valuable industry insights, and explore potential career opportunities in the electrical field!\nhttps://se-images.campuslabs.com/clink/images/a1df08fa-4f25-4616-8fe2-b5c05618280c6eb0cca2-4202-4e1a-807a-a32dc6129253.jpg?preset=med-sq\nmarcellaj1@wit.edu\n", "National Organization of Minority Architecture Students\nFounded in 2016, NOMAS at Wentworth Institute of Technology is an established branch of NOMA with notable impacts on the community around us. Through getting students experience in the field through internship and networking opportunities, professional development is something WITNOMAS excels in. WITNOMAS actively seeks to bring discussion to issues that strike communities in Boston by hosting events with panels of local Architects, networking with local firms and schools and having our own students conversate with one another. We also promote the excellence of the arts and architecture within minority communities on our campus and in Boston to give them a platform to be recognized for their great works. Although still developing, we have established newly-founded traditions that will carry on with our chapter for time to come. \nhttps://se-images.campuslabs.com/clink/images/5d62413c-21f7-4d60-a4d1-12ad76fe0bb5f392a29d-e0fb-4592-89ec-ab85e02b4820.png?preset=med-sq\nnomas@wit.edu\n", "National Society of Black Engineers\nThe NSBE chapter at WIT is a student-led organization that supports Black students and other underrepresented minorities in engineering—while welcoming all majors and all identities. Our mission is “to increase the number of culturally responsible Black engineers who excel academically, succeed professionally, and positively impact the community.” In addition to weekly meetings, we host weekly study sessions with peer tutors across core subjects (e.g., calculus, physics, programming), run skill-building workshops, and organize volunteering/service events. We also attend regional and national conferences to develop our members and advance this mission. We’re excited to meet both new and returning students this year. NSBE is open to anyone who wants to learn, grow, and build community.  \nhttps://se-images.campuslabs.com/clink/images/a4291192-f1f9-42ff-830c-efbc8fc8d1e6cf58d8a9-5288-4917-9a77-482ecd0efdc5.png?preset=med-sq\nat WIT is a student-led organization that supports Black students and other underrepresented minorities in engineering—while welcoming all majors and all identities. Our mission is “to increase the number of culturally responsible Black engineers who excel academically, succeed professionally, and positively impact the community.” In addition to weekly meetings, we host weekly study sessions with peer tutors across core subjects (e.g., calculus, physics, programming), run skill-building workshops, and organize volunteering/service events. We also attend regional and national conferences to develop our members and advance this mission. We’re excited to meet both new and returning students this year.\n", "Office of Institutional Advancement\n\nNone\nNone\n", "Office of Institutional Equity\n\nNone\npellechioa@wit.edu\n", "OneWIT\nIt's 3 a.m. You're up late finding more sources for a group project when you get a text from a friend. You open the message and it says:  \"This is the worst night of my life. I've been crying for hours. I can't deal with this stupid life anymore.\" You want to respond quickly, but hesitate…What can you say? What if things you say only make it worse? What if your friend is thinking of…You don't even want to go there. You want to help, but you're just not sure how… One WIT’s training program gives you the tools to handle this kind of situation. The primary goal of OneWIT is to expand and enrich the campus support network so every member of our community has people looking out for each other — and all know where to go for help when things get tough. To achieve this end, we have a few secondary goals. Knowledge. To give you information about common student struggles, and what you and others can do to help. Skills. To help you develop your helping skills, particularly the skill of empathetic listening and responding, through practice. Perspectives. To provide a safe place to look at issues facing college students from a variety of viewpoints and find a way to think about these without perpetuating stigmas. Connection. To build meaningful connections, both between you and us at the Center for Wellness, and between you and your fellow trainees.\nhttps://se-images.campuslabs.com/clink/images/ad420cc2-bf33-4e2f-8841-2381eb5ec6a07136ea0a-1f1a-4fa5-8893-f53dbd99106f.png?preset=med-sq\ne you information about common student struggles, and what you and others can do to help.\n", "Pre-college Programs\nWentworth's Pre-college Programs help middle school and high school students explore their passions while indulging their curiosities about Science, Technology, Engineering, Design, and Mathematics. Our programs provide high-quality enrichment opportunities for students and families—with a special emphasis on increasing interest and access for youth interested in STEM.  Pre-college Programs provides Wentworth undergraduate students with various leadership opportunities. Whether it is serving as a Residential Program Assistant over the summer or engaging middle school and high school students throughout the year as a STEM Ambassador. We provide the opportunity for current undergrads to engage and inspire future STEM students.      \nhttps://se-images.campuslabs.com/clink/images/85dd3176-cc0d-4a72-a2e8-bc1cd6bfe7a4d84db491-9678-4fad-bd39-41fc91b0bc6b.jpg?preset=med-sq\nprecollege@wit.edu\n", "Ruggles Appreciation Society\nThe Ruggles Appreciation Society is open to all Wentworth students. An organization to show appreciation for Ruggles, the Wentworth Mascot.\nNone\nNone\n", "Ruggles Rundown\n\nhttps://se-images.campuslabs.com/clink/images/93695b84-c9c0-4fd8-aab8-9f9b131abfe41115c9a4-cb94-4be1-9db9-d95516e214e0.png?preset=med-sq\nNone\n", "School of Architecture and Design (SoAD)\nWentworth's School of Architecture and Design is an incubator for ideation, innovation, and creative exploration. Students apply the necessary methodologies and tools to discover who they are as Architects, Interior designers, or Industrial Designers. All of these programs focus on developing and testing creative solutions to real-world problems that excite the imagination.\nhttps://se-images.campuslabs.com/clink/images/789415f9-b2fd-45de-8eea-5d661ad42f62c4f16cc3-68c5-4546-835b-d8480b572f51.png?preset=med-sq\nNone\n", "School of Computing and Data Sciences (SCDS)\nhttps://wit.edu/learning/school-computing-data-science\nhttps://se-images.campuslabs.com/clink/images/d5e76b01-91c8-4381-958e-da2ec6bf3160711c5012-0fc8-4918-bd45-adb8c6504a9d.png?preset=med-sq\nscds@wit.edu\n", "School of Engineering\nThe School of Engineering's mission is to empower, inspire and innovate through experiential learning and a student-centered approach to education. Our faculty members include those with significant industrial, consulting, entrepreneurial, and project management experience and help prepare students for making the transition from school to the real world.\nNone\nNone\n", "School of Management (SOM)\n\nhttps://se-images.campuslabs.com/clink/images/24e3fdff-d108-4a00-b257-050e611770437c1f18b0-1de1-4d6f-a3fc-64323b22852c.png?preset=med-sq\nNone\n", "School of Sciences & Humanities (SoSH)\nAs the backbone for all Wentworth degrees, the School of Sciences and Humanities recognizes that students across all disciplines benefit from building skills in scientific inquiry, communication, ethics, critical thinking, and leadership.\nhttps://se-images.campuslabs.com/clink/images/dc48394b-75a1-47c3-8e1c-f63472ea567573149dfc-b18f-43ff-9c32-4e4bf11400c6.png?preset=med-sq\nsshdean@wit.edu\n", "Society of Hispanic Professional Engineers\nThe main goal of the Wentworth SHPE chapter is to create a voice for the Hispanic community in and out of Wentworth. In order to do so, Wentworth SHPE makes all attempts to be an inclusive group and provide a safe space for the Wentworth community. To embody the mission statement of the national SHPE Organization, Wentworth SHPE highly embraces Hispanic culture to empower the small diverse community at Wenthworth. Wentworth SHPE encourages the Wentworth community to be engaged and gain a new perspective of different cultures.\nhttps://se-images.campuslabs.com/clink/images/34b81846-e770-4bcd-a085-116919f4355189d24336-fcc8-4233-a390-e511310cb335.jpg?preset=med-sq\nshpe@wit.edu\n", "Society of Manufacturing Engineers Wentworth Chapter S007\nThe Society of Manufacturing Engineers Wentworth Chapter is open to all students. We are a resource for students to get more hands-on experience with both proven as well as emerging materials and manufacturing technology. Any student who wants to get more time in the machine shop from any major is welcome. We have access to the Williston 001 manufacturing center.\nhttps://se-images.campuslabs.com/clink/images/44116778-f6b1-47e7-ab99-d9fcfd7e634125ea1173-b9e1-451e-89cd-911e47533e74.png?preset=med-sq\nsme@wit.edu\n", "Society of Women Engineers\nSWE Overview: The Society of Women Engineers (SWE) is a not-for-profit educational and service organization that empowers women to succeed and advance in engineering and be recognized for their life-changing contributions as engineers and leaders. SWE is the driving force that establishes engineering as a highly desirable career for women through an exciting array of training and development programs, networking opportunities, scholarships alongside outreach and advocacy activities. Founded 1950 Objectives Goal 1: Professional excellence – SWE will develop women engineers at all stages of their personal and professional lives. Goal 2: Globalization – SWE will be recognized as a global, inclusive organization that promotes diversity and inclusion and serves women engineers wherever they are. Goal 3: Advocacy – SWE will advocate for the inclusion and success of women, both present and prospective, in engineering and technology. Goal 4: SWE will champion diversity in the engineering and technology professions and promote an inclusive environment. Members Over 40,000 individual members who are collegiates and professionals. Levels SWE has over 300 collegiate member sections and 100 professional member sections.   SWE Mission: Empower women to achieve full potential in careers as engineers and leaders, expand the image of the engineering and technology professions as a positive force in improving the quality of life, and demonstrate the value of diversity and inclusion.   SWE Vision: A world with gender parity and equality in engineering and technology.   SWE Core Values:  Integrity We aspire to the highest level of ethical behavior as evidenced by honesty and dignity within our personal and professional relationships and responsibilities. Inclusive Environment We embrace diversity in its broadest interpretation and commit to creating an inclusive environment for all our members and stakeholders. We value the contributions of a diverse membership, which enables SWE to achieve its full potential. Mutual Support We provide an organization that fosters mentoring and the development of professional and personal networks. Professional Excellence  We professionally conduct our activities, demonstrating and demanding the highest standards of business practices. Trust  We share a common definition of success with open, transparent access to information, building mutual respect and confidence in the abilities of those with whom we lead, serve, and partner.  \nhttps://se-images.campuslabs.com/clink/images/501c861b-2754-49b9-b703-d84b85a888efb83a3004-6942-4190-bfa9-42e52c7c92c1.jpg?preset=med-sq\n\n", "Student Accessibility Services\n\nNone\naccessibilityservices@wit.edu\n", "Student Accounts\nStudent Accounts Office\nNone\nstudentaccounts@wit.edu\n", "Student Conduct & Restorative Practices\nThe Student Conduct and Restorative Practices team assists students in learning their student rights, understanding campus policy, navigating the conduct process, repairing harm on-campus, and providing Bystander Intervention programming.\nhttps://se-images.campuslabs.com/clink/images/e1338ee9-14b3-4444-b0cc-13788c201343c01434d4-39af-4111-8347-c6bfba0eaec9.jpg?preset=med-sq\nwhites10@wit.edu\n", "Student Organization Council\nSOC leaders serve as involvement mentors and student organization success coaches to current student organization leaders and students interested in getting more involved on campus. This includes participating in all aspects of the Student Organization budget allocation process, enhancing the experience for student organizations overall through workshops and targeted programs, and assisting in the logistical support of Clubs and Organizations.\nhttps://se-images.campuslabs.com/clink/images/e0a8ee50-903c-4bf0-ab93-7ba0ccd87e791e6033ec-27d7-4acb-87da-9b988e8955c7.jpeg?preset=med-sq\nsoc@wit.edu\n", "Student Support Lounge @ the Dean of Students Office\nThe Student Support Lounge @ the Dean of Students Office is a fully equipped student lounge with comfortable sofas, student work/study space, and a number of amenities such as: Whiteboard for collaborative work Free school supplies Microwave Fresh cold/hot water Coffee maker Snacks and quick to-go meals Student Support Specialists to answer any questions you may have The Dean of Students Office's Student Support Specialists serve as a resource for students who are available throughout the year to speak with students regarding their specific experience/needs and determine what resources and services on campus (and sometimes off campus) could be helpful. In some instances, we meet with students on a regular basis for ongoing support. \nhttps://se-images.campuslabs.com/clink/images/5c106a74-5517-4ad2-a024-fd088e53735fc0f010e9-6a2a-4835-81c2-921d5a94eee2.png?preset=med-sq\ndos@wit.edu\n", "Student Wellness Education and Empowerment Team\nA group of students committed to keeping the Wentworth student body well-informed about health and wellness topics and empowering them to adapt to change and change their behavior in a positive, interactive, fun and nonjudgmental manner. Educating them about coping skills that would prove to be helpful to overall wellbeing accommodating to different needs and living situations. Reinforcing social responsibility and the effects on environment and community. Topics include alcohol and other drugs; safer sex; stress management; sleep; nutrition; fitness; body image; mental health; tobacco use; healthy relationships; sexual  violence prevention. Providing education with impact as well as education implementation. SWEET members are advised by Amber Goulart-the Assistant Director of Health Promotion and Education. \nhttps://se-images.campuslabs.com/clink/images/daf75a48-9c57-4d2c-89c3-14d8ebe6633f23d1cff0-f685-49d5-aead-fdabf0ffe809.png?preset=med-sq\ngoularta1@wit.edu\n", "Success Studio\nAt Wentworth, we are wholeheartedly committed to student success. In support of this mission, the Success Studio acts as the central hub dedicated to helping our students thrive through Student Success Advising, Academic Support and Tutoring, and Student Accessibility Services. If you have any questions, please email successstudio@wit.edu. To speak with any of our staff please make an appointment through EAB Navigate. Student Success Advising Student Success Advisors (SSAs) support students in the transition to college by assisting with degree planning, course selection, academic coaching, and connecting students to campus-wide resources. The Role of a Student Success Advisor: - Coaching Transition and Success - Connecting to resources - Registration and Academic Planning Connecting with a Student Success Advisor: - Students can connect with their SSA through EAB Navigate, via email, or in person by stopping by the Success Studio to make an appointment. Academic Support Academic Support links students with professional and peer tutors. Tutoring services are available for all Wentworth students at no cost. For any questions geared toward Academic Support email us at academicsupport@wit.edu Tutoring Options: - Tutoring is available one-on-one by appointment in-person and remotely via Zoom. Tutoring is also available in drop-in group review sessions. - Check out the Academic Support section on our webpage each semester for a list of drop-in group review sessions. Scheduling a tutoring appointment: Students can book tutoring appointments from 9 am to 8 pm Monday through Friday. Student Accessibility Services Student Accessibility Services (SAS) provides support and accommodations for students with disabilities to fully participate in the college experience at Wentworth. Accommodation Eligibility: - Students with physical, medical, psychiatric, learning disabilities and other diagnoses are eligible to utilize SAS to arrange for reasonable accommodations and seek ongoing support at any point in their Wentworth career. Meeting with SAS  - To get started, students can fill out the Accommodation Request Form found on our webpage and schedule a meeting through EAB Navigate, or email us at access@wit.edu - Meetings can be held in-person, remotely via Zoom, or by phone call. - Registration and Academic Planning\nhttps://se-images.campuslabs.com/clink/images/75fc9ae8-7de7-4268-b02b-4c584c779e99ed61044f-c69d-413c-8c5f-5f31690b5e8b.png?preset=med-sq\nsuccessstudio@wit.edu\n", "Tabletop and Alternative Gaming\nThe Tabletop and Alternative Gaming at Wentworth is open to all students. We specialize in card games, board games, and tabletop RPGs. We have a collection of games we bring to each club meeting and encourage members to bring games they may want to play with the club. If you've ever been interested in board games, cards games and/or tabletop games, even if you don't know how to play, this is the club for you! If you're interested in learning more join our discord here\nhttps://se-images.campuslabs.com/clink/images/431a0795-a323-40bd-9f95-fb11cc6f7edc60797697-92eb-4113-87f7-262d51e7cd2f.png?preset=med-sq\nrso_tag@wit.edu\n", "TechSpot\nIf you would like to directly contact the Tech Spot, here are some options. Phone: (617) 989-4500 Email: techspot@wit.edu\nhttps://se-images.campuslabs.com/clink/images/a404f019-87d7-4e85-913d-9524e9eb888a5ee5b9f3-6b74-4ddc-9215-b21c49988d95.png?preset=med-sq\n\n", "The Center for Community & Learning Partnerships\nWentworth, through the CLP, is committed to helping Boston area students create pathways to college and career success. To help them achieve these important goals, we offer several programs as part of our Boston Pipeline Initiative that local youth can participate in, from RAMP to Industry Corps, gaining unprecedented experience in a college environment.\nhttps://se-images.campuslabs.com/clink/images/59776205-354c-47a9-b782-92a16728ecc9159352ae-e75e-46bf-bc66-93971c823618.PNG?preset=med-sq\nNone\n", "The Division of Diversity, Equity and Inclusion\n\nNone\nemmanuelj1@wit.edu\n", "Undergraduate Admissions\n\nhttps://se-images.campuslabs.com/clink/images/3435ee94-ae11-4f2c-8ed9-95d671aa4fbe5e9e1aff-042f-4050-8200-6befd7db7d4f.png?preset=med-sq\nadmissions@wit.edu\n", "Wentworth African Student Union\n\nhttps://se-images.campuslabs.com/clink/images/26905960-10da-453a-b1bf-a8dfdaf33d866fa4699e-abfe-4cd1-b5a9-51a7ab61c474.png?preset=med-sq\nwasu@wit.edu\n", "Wentworth Anime Club\nThe Anime club at Wentworth is open to all students. We hope to create a safe environment to talk about interests and opinions on various types of Japanese media along trends in Japanese pop-culture.   Our weekly meetings are either a trivia-style game night or a debate/popularity vote. It's not everything we do, but what happens most of the time.   We also have opportunities for a discount on badges for the Anime Boston convention. If you'd like to know more, reach out to us on the discord or when we have a meeting   If you're interested, we invite you to join our discord server where we announce our meeting plans ahead of time: https://discord.gg/KFwVsGc\nhttps://se-images.campuslabs.com/clink/images/edfae8ca-5319-4400-9f2e-1303c7295c1bf49dd022-940c-4602-bb78-3993e7d4522d.png?preset=med-sq\nanime@wit.edu\n", "Wentworth Athletics\nLeopard Philosophy It is the mission of the Wentworth Department of Intercollegiate Athletics to provide for our student-athletes the best possible environment in which to experience and benefit from their participation in intercollegiate athletics. Wentworth believes strongly in that being a member of a Division III athletics team can be an invaluable part of the overall educational experience and is an opportunity to build responsibility, pride, and character in an individual. Specifically, Wentworth Athletics seeks to: INSPIRE our athletes to set high goals both as a team and as individuals, and to achieve athletically, academically, professionally, and personally. ENGAGE athletes not only in the spirit of sportsmanship and competition, but also in their larger communities—both at Wentworth and beyond. IMPACT each other and the people around them through demonstrated leadership, integrity, and perseverance. As an Athletics Department we strive to provide the necessary resources and support to make all of this possible for our student-athletes. Quick Facts   Location 550 Huntington Avenue Boston, MA 02115-5998 Nickname Leopards Colors Black, Gold National Affiliation NCAA (Division III) Conference Affiliations ECAC, Commonwealth Coast Conference, GNAC (men's volleyball) Athletic Office Number (617) 989-4655 Athletic Office FAX (617) 989-4150 E-Mail Address athletics@wit.edu\nhttps://se-images.campuslabs.com/clink/images/ec977604-7d5e-4687-b4dd-512608692e6f71cfb99e-ffcf-48f5-ba5d-e4db0e09b87b.png?preset=med-sq\ny\n", "Wentworth Billiards\nThe Wentworth Billiards club is open to all students. For more information on upcoming tournaments and leagues, visit wentworthbilliards.carrd.co\nhttps://se-images.campuslabs.com/clink/images/3cd50190-b646-4e22-816f-52717e4116c7d259742c-9055-42d6-b033-6a33079a7bb0.png?preset=med-sq\nharounianj@wit.edu (Joseph Harounian)\n", "Wentworth Chess Club\nThe Wentworth Chess Club is open to all students. Welcome to the Wentworth Chess Club! Do you remember your dad/uncle/grandmother taught you when you were 10 and you haven't played since? Or maybe you play for fun once in a while? Maybe you are already an avid chess player?  Or maybe you've never even heard of chess before? Either way, Chess Club is for you! The Wentworth Chess Club runs inclusive, fun, and engaging events that promote the game of Chess. We play chess, teach chess, host tournaments, and collaborate with other universities. Chess players of any skill level are welcome, including beginners or new players. If you're interested in chess, making friends, animal crackers, or anything fun, join us. To start, join our Discord: https://discord.gg/qaCHnXpmM8 or contact linj14@wit.edu  \nhttps://se-images.campuslabs.com/clink/images/25001628-2a85-4079-a36c-e3e4a7dcc1e439c9f949-b483-4ee8-acfc-38d649cec0fc.png?preset=med-sq\nntworth Chess Club!\n", "Wentworth Club Hockey\n\nhttps://se-images.campuslabs.com/clink/images/8912814a-a611-4ac8-b821-c88e09dbe4d8b93450c5-16d2-4154-8fbc-38c689dcc18f.jpg?preset=med-sq\nwitclubhockey@wit.edu\n", "Wentworth Coding Club\nThe Wentworth Coding Club is open to all students across COF. The purpose of the WIT Coding Club is to bring together a community of students who are interested and motivated in practicing their programming abilities. We will host hackathons and weekly meetings for the club. Discord: https://discord.gg/fkeM94snmy\nhttps://se-images.campuslabs.com/clink/images/f86baed1-9c39-43fa-b56b-11b13833a01bb7673484-6092-4b7d-b9db-84cb8c734c25.png?preset=med-sq\nrso_witcc@wit.edu\n", "Wentworth Design review\nThe Wentworth Design review is open to all students. Wentworth Design review is a program that utilizes the talents of design students and faculty in service to their community by procuring their works in a design journal that is published every school year. WDr uses the talents of design students to radically impact the lives of people in their community through sharing design review journals. The program embraces efforts to provide both design feedback and engagement solutions to bring the Wentworth Design community together and showcase their amazing work. All WDr projects should allow individuals to live; in a safe environment void of physical or implied barriers; with a sense of dignity becoming any individual of the community; and with the same comfort that any one member of society experiences.\nhttps://se-images.campuslabs.com/clink/images/d50fa6a4-ab97-421a-a93f-22b7538fe5f1cf40e632-a3fa-4224-88c5-1746635b509e.jpg?preset=med-sq\nwar@wit.edu\n", "Wentworth Digital Photography Club\nThe Wentworth Digital Photography Club is open to all students. WITDPC is club to create a safe and comfortable learning environment for all respectable students of Wentworth, and the Institutions of the Colleges of Fenway, to learn, practice, and enhance the basic skills of photography and digital editing\nhttps://se-images.campuslabs.com/clink/images/393a4790-7b8c-415f-a2c5-3be5c47c9964fd43bebc-9345-490c-9c57-a69ff3659216.jpeg?preset=med-sq\nwitdpc@wit.edu\n", "Wentworth Engineering Honor Society\nMission Statement: The Wentworth Engineering Honor Society recognizes high-achieving students from all engineering disciplines at Wentworth Institute of Technology. The WEHS: Recognizes those who have displayed distinguished scholarship and exemplary character while at Wentworth or as alumni; Provides leadership and development training and opportunities for its members; Promotes lifelong learning and member involvement.   The Wentworth Engineering Honor Society was formed as a first step in forming a Tau Beta Pi Engineering Honor Society Chapter at Wentworth. As such, the mission of WEHS is modeled after the Tau Beta Pi and their mission statement.      \nhttps://se-images.campuslabs.com/clink/images/baad5a62-2a03-4a11-8301-02e1215069c1fca0141f-beb2-4c62-9923-a4538e208414.png?preset=med-sq\n:\n", "Wentworth Events Board\nWentworth Events Board (WEB) is responsible for planning and hosting most of the events on and off Wentworth's campus for Wentworth students. Our past events have included rock climbing, laser tag, movie nights, paint nights, and game nights that happen on both weeknights and weekends. WEB also hosts WEB Wednesday every Wednesday inside Beatty Hall at lunch time, providing fun crafts or snacks for students. Our biggest event is a Wentworth tradition that takes the whole year to plan it is the annual Beaux Arts Ball. This annual event is a semi-formal night event filled with music, dancing, and yummy food located at a special place in Boston. Please check our Instagram for more info and consider joining!\nhttps://se-images.campuslabs.com/clink/images/3f242d1e-4025-443a-9103-135af74f6f3cbe3e87a3-72a6-432c-8aa6-226bec74f56b.PNG?preset=med-sq\nevents@wit.edu\n", "Wentworth Graduate Admissions\nAt Wentworth, our graduate students make up a dynamic community of problem-solvers and challenge-accepters, ready to take action and change the world. As the university of opportunity, Wentworth is committed to providing pathways to leadership in architecture, engineering, business, information systems, computing, data science, and management for an inclusive and diverse population of working professionals. We welcome students from across the city and around the world. If you share our drive and our can-do spirit, then you belong here.\nhttps://se-images.campuslabs.com/clink/images/22226649-3edd-4af0-b5da-8600aab77070050dabb9-9d3e-44ba-b6d6-12dcb1cab338.png?preset=med-sq\ngradadmissions@wit.edu\n", "Wentworth Graduate Students\nThis portal will feature programs of interest and planned for Wentworth graduate students. \nhttps://se-images.campuslabs.com/clink/images/05319a72-70bf-48c7-beca-164ca55a551e4157b881-073e-4675-8411-1770d5549688.png?preset=med-sq\nNone\n", "Wentworth Green Team\nThe Wentworth Green Team is open to all students. Wentworth Green Team is an environmental collaborative that works with students from the COF to better our community's environment. They host frequent trash pick-ups, host fun green events and develop research projects. \nhttps://se-images.campuslabs.com/clink/images/a0604b68-f931-4b8d-b713-894df5d4136fe7631853-23ed-43f4-8e1f-37f06537e711.png?preset=med-sq\ngreenteam@wit.edu\n", "Wentworth Honors Program\nProvide challenging/enriching educational experience beyond traditional classroom. Foster culture of intellectual curiosity, creativity, and lifelong learning. Offer unique opportunities for research, community engagement, global engagement, and leadership. Equip students with skills, knowledge, & values to make meaningful contributions to their fields of study/ society at large. Prioritize Inclusive Excellence & High Value Learning via programmatic and academic efforts.\nhttps://se-images.campuslabs.com/clink/images/e81d58c6-a138-4907-b948-9835f4b29fefde039d16-07ea-46e0-affc-5184cf7afcfb.png?preset=med-sq\nhonors@wit.edu\n", "Wentworth Housing & Residential Education\nAt Wentworth, you'll enjoy small college comforts and big city excitement. Our 31-acre campus in the heart of Boston boasts a tree-lined quad, modern and traditional residence halls, and diverse campus amenities such as a dining hall, bookstore, convenience store, the rich resources of the Douglas D. Schumann Library & Learning Commons, computer center, a 24-hour Department of Public Safety, and numerous social activities. \nhttps://se-images.campuslabs.com/clink/images/1cd17aeb-5019-497b-9d77-2222219d019cfe9f576f-1f38-4faf-808f-d0d65aefbf3f.JPG?preset=med-sq\nhousing@wit.edu\n", "Wentworth Institute of Technology Aerospace Club\nThe Wentworth Institute of Technology Aerospace Club is open to all students. WITAero aims to provide students with exposure to the aerospace engineering field by participating in the AIAA Design-Build-Fly airplane competition. By participating in the DBF competition, students can network with companies within the aerospace engineering field, such as Lockheed Martin, Raytheon Technologies, Textron Systems, etc. Additionally, students can elect to become an AIAA student member, providing them with additional aerospace knowledge in the form of newsletters and conferences. Underclassmen work closely with seniors to help put together a competition-ready RC airplane. \nhttps://se-images.campuslabs.com/clink/images/6f6065bb-7e7d-44c3-a14e-7798996ab9e566116dd8-a03a-4b7b-ad0e-fc5afb7680ee.png?preset=med-sq\nwitaero@wit.edu\n", "Wentworth Institute of Technology Gaming Club\nThe Wentworth Institute of Technology Gaming Club is open to all students. Wentworth Institute of Technology Gaming Club's mission is to promote the Wentworth gaming community throughout the Wentworth campus and expand our outreach to Colleges of Fenway. All students, faculty, and staff of Colleges of Fenway are strongly encouraged to participate in our events to foster a diverse, equitable, and inclusive environment. WITGC shall also promote health awareness by hosting community-based, interactive gaming events that bring more awareness to social connectedness. Join us on our Discord server at https://discord.gg/KcGTjJjFKt or visit https://linktr.ee/witgc to see our other active promotions!\nhttps://se-images.campuslabs.com/clink/images/7f0fda98-f382-45fc-8ba6-33a4e0267711d29ed882-4b80-412d-9021-9f6b1fb3b0f4.png?preset=med-sq\nWITGC@wit.edu\n", "Wentworth Internet Radio Experience\nThe Wentworth Internet Radio Experience is open to all students. WIRE is a creative hub that is able to draw from the vast resources that its surrounding community contains, as well as give back to those around us through our passion for -- and practice of -- the audio arts.\nhttps://se-images.campuslabs.com/clink/images/4aaf65df-c6c0-4666-960e-e6a82ef471c67ac81fce-4623-493c-9316-902373d7cb6d.png?preset=med-sq\nwire@wit.edu\n", "Wentworth Karting Club\nThe Wentworth Karting Club is open to all students. The Wentworth Karting Club aims to teach and expand the sport of automotive racing here at Wentworth. We strive to grow our community and create friendly competition on the racetrack, while teaching fundamental automotive engineering processes through the design and construction of our own karts.\nhttps://se-images.campuslabs.com/clink/images/056d160c-afd6-4bda-bb24-a82e12ecd66c8335a3df-bada-47e2-a9b5-2ff0178ba241.png?preset=med-sq\nrso_wkc@wit.edu\n", "Wentworth Leadership Initiatives\nWentworth Leadership Initiatives - the home of the Emerging Leadership Series, Peer Leadership Series, and the Leadership in the Workplace Series.\nhttps://se-images.campuslabs.com/clink/images/e65a17f1-059f-435d-83e3-c053ddc33acddac01315-e7d7-425e-97d1-ca3fd1890ee1.png?preset=med-sq\nstudentengagement@wit.edu\n", "Wentworth MCAA Student Chapter\nThe Mechanical Contractors Association of America at Wentworth is open to all students. There are numerous opportunities and benefits in joining the MCA Student Chapter. This includes co-op opportunities in the mechanical industry, networking with other student members, a chance to compete in competitions, volunteering, and scholarships. \nhttps://se-images.campuslabs.com/clink/images/8b8fcede-8cda-41f7-8dbe-b5e483d0c73e57d60bb9-5e5b-4a54-a678-5ceabcc79f4b.png?preset=med-sq\nmcaa@wit.edu\n", "Wentworth Men's Rugby Club\nThe team plays during both the fall and spring semesters. Practices/meetings are 2-3 evenings per week and matches/tournaments take place on the weekends. Men's Rugby accepts players of all shapes, sizes, and athletic ability. No prior experience with the game of rugby is required (most players never played before college), we spend a lot of time teaching the game to newcomers at the start of every season. The only equipment necessary is cleats and a mouthguard. \nhttps://se-images.campuslabs.com/clink/images/b9599e13-d89d-45f2-8312-0cd1fe431c0d6804e3e9-89d3-493e-be1c-c3f0df6dd298.jpg?preset=med-sq\nhaynesc3@wit.edu\n", "Wentworth Mentorship Program\nPromote, inspire, and develop productive relationships to aid in the transition of first year students academically and socially into the Wentworth community. Between faculty advisors, upperclassmen peers, and the student, the network of support will ultimately create inclusiveness, focusing on personal development while fostering future student leaders.\nhttps://se-images.campuslabs.com/clink/images/64cd4e77-f8c5-4576-bc9a-506c6ce71dd54eeab731-0e4f-4e9f-a88d-4594993c16cb.jpg?preset=med-sq\nmentorship@wit.edu\n", "Wentworth Orientation\nWentworth Orientation introduces new students and their families to the Wentworth Institute of Technology community. Through a series of engaging programs—including New Student Orientation (NSO) and Wentworth Opening Week (WOW)—the Orientation team helps students build connections, learn about campus resources, and transition successfully into academic and campus life. Our mission is to foster a sense of belonging, prepare students for success, and celebrate the start of their Wentworth journey.\nhttps://se-images.campuslabs.com/clink/images/cc857b16-a6a7-4616-8f81-8aa55af7f74dc1fb0d23-c2ef-4bfd-9299-95373f0bf21c.png?preset=med-sq\norientation@wit.edu\n", "Wentworth PicoSat\nThe Wentworth PicoSat Organization is open to all students. A multidisciplinary group of engineers at Wentworth Institution of Technology building a satellite that you can fit in the palm of your hand. Called a pico-satellite, or PicoSat for short, this satellite will travel at 16,000MPH at an altitude of ~550km.\nhttps://se-images.campuslabs.com/clink/images/e48cfa55-941c-4d53-a46b-5a4aacfdcab7105b8a7d-05be-415b-8a9b-fb2f4a843054.jpeg?preset=med-sq\nNone\n", "Wentworth Poker Club\nWelcome to the Wentworth Poker Club! The Wentworth Poker Club is open to all students. About Us Welcome to the official page of the Wentworth Poker Club, where we bring the thrill of poker to the heart of Wentworth Institute of Technology. Whether you're a seasoned poker pro or a complete newbie, you've found your new home among fellow poker enthusiasts. Our Mission The Wentworth Poker Club is dedicated to creating a stress-free environment where students can learn, practice, and improve their poker skills. Our club is open to all Wentworth and Colleges of the Fenway students, regardless of their level of experience or knowledge of the game. We offer a variety of poker games, including Texas Hold'em, Stud, and PLO, and we're always open to exploring other exciting variants. What We Do Weekly Meetings: Join us every week for fun and engaging meetings. Stay tuned for announcements about meeting times and locations, and make sure to bring your poker face! Tournaments: Get ready to test your skills in poker tournaments, and we're even looking to compete against other schools in events like the IPA league. Prizes and Events: We'll host exciting events with great prizes and experiences that you won't want to miss. Membership Becoming a member is easy. Just attend three meetings per semester to be eligible. We have no strict requirements, and all members can actively participate in our activities and have a say in club decisions. Get Involved Our club officers, including the President, Treasurer and Vice President, are here to guide the club and ensure that everything runs smoothly. If you have ideas, questions, or want to contribute, please don't hesitate to reach out to us. Stay Connected Be sure to follow us on social media and stay updated with our latest events, news, and poker tips. Join Us Today! Ready to ante up and join the fun? We welcome students from all backgrounds and experience levels. Feel free to explore our website, attend our meetings, and become part of the Wentworth Poker Club community. Join us for an unforgettable poker experience, meet new friends, and develop your poker skills in a welcoming, friendly environment. We look forward to seeing you at our next meeting! TO JOIN THE DISCORD CLICK ON THE GLOBE ICON!!!!!!!!\nhttps://se-images.campuslabs.com/clink/images/8953cc25-fb09-4a1a-bcb8-8d0b8dce9474334476f0-86c8-4288-954f-70d848e25a78.png?preset=med-sq\nntworth Poker Club!\n", "Wentworth Police\n\nhttps://se-images.campuslabs.com/clink/images/f372f147-cd23-46a4-8a08-92feeea3e772973275dc-9bed-4b28-8704-1496033c5ac9.png?preset=med-sq\nNone\n", "Wentworth Robotics Club\nThe Wentworth Robotics Club is open to all students. The purpose of WRC is to promote the development of students’ technical skills through a shared passion and knowledge of automation and robotics, while sharing our passion and skills with those who want to learn more about these fields. We want to help enforce the idea of creativity in engineering with relevant projects built in teams along with leadership skills to those who wish to run projects of their own.\nhttps://se-images.campuslabs.com/clink/images/5f929f3e-cbb1-4d94-b1d1-902ca215af99788b3832-b7a5-4f81-b8ba-76b512c070df.png?preset=med-sq\nwitrobotics@wit.edu\n", "Wentworth Sailing\nWelcome to the Leopard spot page for the Wentworth Sailing team!  - We Practice (Monday / Wednesday / Friday) from 3:00 pm - Sunset  - On the Weekends we compete in the NEISA conference of the ICSA at Regattas all across New England  - If you wish to try out for the team mid-season please reach out and we can try to fit you in! BUY MERCH HERE - https://wit-sailing.itemorder.com/shop/home/   \nhttps://se-images.campuslabs.com/clink/images/3c5d9171-31a2-4094-8b26-3ece2fcc324d99c169f8-38ef-44fe-a45b-20e3b899d5a6.jpg?preset=med-sq\ndankj@wit.edu\n", "Wentworth Ski & Snow\nThe Wentworth Ski & Snow Club is open to all students. WIT Ski exists to promote downhill winter sports in the Wentworth community. Sports such as skiing and snowboarding are challenging and healthy, yet fun, ways for the Wentworth community to come together. As a club, WIT Ski will facilitate trips to mountains where the membership can participate in these sports on their own, with friends, or take lessons. WIT Ski will work to increase access to downhill winter sports for the Wentworth community through affordable transportation and lift passes. Join Our WhatsApp for best communication: https://chat.whatsapp.com/IWT0j4QhYIUCWKJwWEGnn3\nhttps://se-images.campuslabs.com/clink/images/68b79b19-dde1-49fa-8df0-c325cfb92e776b026a73-9fa4-4649-a2e4-47b2fab7b823.jpg?preset=med-sq\nmartinezv2@wit.edu\n", "Wentworth Sounding Rocket Team\nThe Wentworth Institute of Technology Sounding Rocket Team is open to all students. The Wentworth Institute of Technology Sounding Rocket Team is a dedicated and diverse group of students hailing from various academic disciplines. With a common interest in aerospace engineering, rocketry, and a thirst for exploration, our team collaborates to achieve extraordinary goals. Our organization is an incubator of scientific creativity, engineering excellence, and educational outreach. Throughout the year, we will be building multiple competition rockets, as well as teaching our members how to build and fly their own high-powered rockets.\nhttps://se-images.campuslabs.com/clink/images/e51345fd-9ca4-4c0f-b077-042618978b3fa37e9e00-9485-491e-8dbf-3835c7e07379.png?preset=med-sq\nNone\n", "Wentworth Sustainability\n\nNone\nNone\n", "Wentworth Ultimate Frisbee\nThe Wentworth Ultimate Frisbee Team plays under the team name of \"Concrete Jungle\". Concrete Jungle is a Co-ed team that has no tryouts or \"Cuts\". The team plays in both the fall and spring semesters and practices 2-3 times a week. No prior knowledge of the sport is required. The fall season is dedicated to teaching new players the sport, building team chemistry, and playing in low stakes tournaments. In both the fall and spring the team plays in monthly tournaments around New England. Cleats are recommended but not required, and no additional equipment is needed. This team is a great way to stay in shape, meet new people and support each other on and off the field, and have some fun without the commitment of a full-time varsity sport.\nhttps://se-images.campuslabs.com/clink/images/c6509be5-236f-4b3e-a6c7-e987f058047636bf37e5-c84b-4040-bf09-e06d98460aff.JPG?preset=med-sq\nhurleys2@wit.edu\n", "Wentworth Women's Collective\nThe Wentworth Women’s Collective is a student-led advocacy group based out of the Center for Cultural and Global Engagement that will guide and support women initiatives via an Executive Board comprising several positions. The Women’s Collective will also act as a programming board. The mission of the Women's Collective is to promote and support the academic, professional, and social success of Wentworth Women.\nhttps://se-images.campuslabs.com/clink/images/2279f99f-c36a-44e9-972d-4d93602938a164100ad5-2b2d-49ee-bc65-5f84d6cdf8ed.png?preset=med-sq\nwwc@wit.edu\n", "Wentworth Women’s Rugby\nThe Wentworth Women’s Rugby Club was founded in 2003 and joins women and non-cis gender individuals from each COF school to play and promote the game of rugby. Through determination and hard work by these student athletes, the team competes against multiple in conference and out of conference New England club teams throughout the fall and spring seasons. Students of all backgrounds are encouraged to join, including both those who have been varsity athletes in the past, and those who have never played a competitive sport. We value our inclusive community and strive to be the most welcoming club in the COF. Women’s Rugby is the only women’s club sport at Wentworth and provides them with the opportunity to play an empowering sport while also connecting with students across all the COF schools. Our coaches and captains teach and train us to develop our technical skills, fitness and understanding of the sport.\nhttps://se-images.campuslabs.com/clink/images/7a200bba-55ae-4d34-be03-0e5f3c5406e20bffb4f4-6720-4ab5-be8d-598842faf786.jpeg?preset=med-sq\nwasona@wit.edu\n", "WIT SAE Leopard Racing\nThe Society of Automotive Engineers (SAE) Baja club at Wentworth is open to all students. The Society of Automotive Engineers (SAE) Baja club at Wentworth is a developing organization with strong and demanding goals for the future.  Our club is about ten years old with over 30 active members ranging from freshmen to seniors and from mechanical engineering to construction management majors. Our club is built on our passion for cars, trucks, motorcycles, and hard work. In 2018, the car barely made it to the SAE competition in Maryland. In 2019, we were finally able to race the finished car in the Rochester competition. In 2023 and 2024 we were able to compete in Ohio and Michigan using our first new chassis since before the pandemic. In 2024 our season was the most successful season in over a decade.  We have the experience. We have the determination. We have the passion. Now, all we need is your support.  \nhttps://se-images.campuslabs.com/clink/images/821ae39c-6823-4dc2-b6bd-52b74805635ecdba18f1-99f4-43b6-8ce0-789137363e4b.jpg?preset=med-sq\nconnorsh@wit.edu\n", "Women in Cybersecurity at WIT\nWomen in CyberSecurity (WiCyS), established through a National Science Foundation Grant to Tennessee Tech University in 2013, is a nonprofit 501(c)3 membership organization that works to advance women in the cybersecurity workforce.  WiCyS accomplishes its mission to recruit, retain, and advance women in the field of cybersecurity through the organization of its volunteers into student chapter groups worldwide. These volunteer groups enhance the WiCyS mission through outreach, awareness, networking, sharing, mentoring, and engagement. \nhttps://se-images.campuslabs.com/clink/images/9ac39019-a54c-4ed4-aebe-5fbd6648dc32bac0c390-c726-4b66-acf7-5612bb4367fc.png?preset=med-sq\nwicys.wit@outlook.com\n", "Women@Wentworth\nThe goal of the Women@Wentworth Undergraduate Leadership Experience is to connect students to a diverse community of mentors and role models as they catalyze their career potential and develop their unique abilities to lead. Students customize the their leadership pathway to align with their personal and professional goals as they learn to optimize their strengths, build networks, and cultivate tenacity for a lifetime of success.  What is W@W UG Leadership Program? W@W UG Leadership Program is a customized, experience-based, learning pathway designed to bring recognition to the in-demand, career-readiness skills that students are building in and outside of the classroom through the leadership activities they already do in ANY context on campus. Whether they are engaging in a women-focused activity or leading an all-identity club or organization, they can earn Wentworth-verified digital badges and a certificate for their efforts. By tracking their experiences and reflecting on the lessons they have learned, students are issued a digital badge for each year of completion. Why does Wentworth offer identity-based programs? The value of Identity-Affinity settings is supported through extensive research and provide a unique context for learning that enhances access to creativity, drives innovation, and builds career advancement. Any developmental gains made transfer to all-identity settings with benefits for the individual and those they interact with. Research backed benefits include: (1) increased leadership self-efficacy (“I can do this!”); (2) increased goodness of fit (I belong here.); (3) decreased identity threat (“Even if I am in the non-dominant group around here, I will succeed!”); (4) increased psychological safety (“I am safe, fit in, and can take risks.”); (5) decreased emotional labor (“I can relax and focus on being my best self.”). How does this differ from other women identity-based organizations on campus? W@W UG Leadership Program is not a club or an organization, it is a micro-credential learning pathway, that allows students to track and showcase the career-readiness competencies via Brightspace, that they gain from activities taking place outside the classroom. W@W UG also hosts and co-sponsors numerous events and activities throughout the year, that are open to all students, providing ample opportunities for any student, regardless of other activity or club affiliation, to fulfill the badge requirements. Who can sign up for this program? All students, regardless of gender identity, are welcome to participate. The program provides a custom framework that allows students to make it their own. Students can begin the program at any point during their time at Wentworth and complete the program prior to graduation, however we encourage students to enroll in their first year at Wentworth to maximize the benefits and experience. Why would students want to participate? The program aims to provide students with an opportunity to: (1) connect to a diverse community of leaders, mentors, and role models. (2) Create and showcase a portfolio of developmental experiences that they customize to their unique personal and professional goals. (3) Follow a self-directed path to develop leadership skills, build networks, and cultivate tenacity for a lifetime of SUCCESS. (4) Earn verified micro-credentials + an exclusive graduation stole! What is a digital badge? Like a diploma, a digital badge serves as a visual proof validating credibility, competency, and earning requirements of a specific program. Once you complete and submit requirements on Brightspace, you will be issued a digital badge that can be displayed on your LinkedIn, resumes, or other digital signatures. How do I get started? Simply self-enroll in Women@Wentworth Undergraduate course Brightspace to join our mailing list and start earning your badges today!   \nhttps://se-images.campuslabs.com/clink/images/748dc1fd-69d9-496b-8085-f7438828e7a53106a5b2-6928-4e89-9b05-1585567f554f.png?preset=med-sq\nadership Program?\n"]